package cn.dancingsnow.art;

public enum MainStats {

    数值血量("14001"),
    数值攻击("12001"),

    沙漏精通("10950"),
    充能("10960"),
    沙漏百分比防御("10970"),
    沙漏百分比生命("10980"),
    沙漏百分比攻击("10990"),

    杯精通("50880"),
    物理伤害加成("50890"),
    草元素伤害加成("50900"),
    岩元素伤害加成("50910"),
    风元素伤害加成("50920"),
    水元素伤害加成("50930"),
    冰元素伤害加成("50940"),
    雷元素伤害加成("50950"),
    火元素伤害加成("50960"),
    杯百分比防御("50970"),
    杯百分比生命("50980"),
    杯百分比攻击("50990"),

    头精通("30930"),
    治疗加成("30940"),
    暴击伤害("30950"),
    暴击率("30960"),
    头百分比防御("30970"),
    头百分比生命("30980"),
    头百分比攻击("30990"),

    ;
    public final String id;

    MainStats(String id) {
        this.id = id;
    }
}
